; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v13 ?v7)
             (pred_5 ?v8 ?v9)
             (pred_6 ?v13 ?v9)
             (pred_10 ?v10 ?v13 )
	     (pred_2 ?v13)
             (pred_12 ?v12)
             (pred_11 ?v8)
             (pred_4 ?v9)
             (pred_1 ?v13)
             (pred_3 ?v8)
             (pred_8 ?v13)
             (pred_9 ))



(:action op_4
:parameters (?v3 ?v5 ?v6 ?v2)
:precondition (and (pred_12 ?v3) (pred_12 ?v5) (pred_11 ?v6) (pred_4 ?v2)
          (pred_7 ?v3 ?v5) (pred_5 ?v6 ?v2)
                   (pred_6 ?v5 ?v2) (pred_2 ?v3) 
                   (pred_1 ?v5) (pred_3 ?v6))
:effect (and  (pred_8 ?v5) (not (pred_1 ?v5))))


(:action op_2
:parameters (?v3 ?v1)
:precondition (and (pred_12 ?v3) (pred_12 ?v1)
               (pred_2 ?v3) (pred_7 ?v3 ?v1) (pred_8 ?v1))
:effect (and (pred_2 ?v1) (not (pred_2 ?v3))))

(:action op_3
:parameters (?v3 ?v6)
:precondition (and (pred_12 ?v3) (pred_11 ?v6) 
                  (pred_2 ?v3) (pred_10 ?v6 ?v3) (pred_9 ))
:effect (and (pred_3 ?v6)
   (not (pred_10 ?v6 ?v3)) (not (pred_9 ))))


(:action op_1
:parameters (?v3 ?v4 ?v11)
:precondition (and (pred_12 ?v3) (pred_11 ?v4) (pred_11 ?v11)
                  (pred_2 ?v3) (pred_3 ?v11) (pred_10 ?v4 ?v3))
:effect (and (pred_3 ?v4) (pred_10 ?v11 ?v3)
        (not (pred_3 ?v11)) (not (pred_10 ?v4 ?v3))))

(:action op_5
:parameters (?v3 ?v6)
:precondition (and (pred_12 ?v3) (pred_11 ?v6) 
                  (pred_2 ?v3) (pred_3 ?v6))
:effect (and (pred_9 ) (pred_10 ?v6 ?v3) (not (pred_3 ?v6)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_10 obj_13 obj_12 obj_24 obj_07 obj_19 obj_17 obj_02 obj_18 obj_14 obj_29 obj_11 obj_04 obj_03 obj_06 obj_21 obj_20 obj_30 obj_26 obj_01 obj_05 obj_15 obj_08 obj_09 obj_27
    obj_23 obj_25
    obj_22 obj_16 obj_28
    )

    (:init
       (pred_9)

       (pred_12 obj_10)
       (pred_12 obj_13)
       (pred_12 obj_12)
       (pred_12 obj_24)
       (pred_12 obj_07)
       (pred_12 obj_19)
       (pred_12 obj_17)
       (pred_12 obj_02)
       (pred_12 obj_18)
       (pred_12 obj_14)
       (pred_12 obj_29)
       (pred_12 obj_11)
       (pred_12 obj_04)
       (pred_12 obj_03)
       (pred_12 obj_06)
       (pred_12 obj_21)
       (pred_12 obj_20)
       (pred_12 obj_30)
       (pred_12 obj_26)
       (pred_12 obj_01)
       (pred_12 obj_05)
       (pred_12 obj_15)
       (pred_12 obj_08)
       (pred_12 obj_09)
       (pred_12 obj_27)
       (pred_4 obj_23)
       (pred_4 obj_25)
       (pred_11 obj_22)
       (pred_11 obj_16)
       (pred_11 obj_28)

       (pred_7 obj_10 obj_19)
       (pred_7 obj_10 obj_13)
       (pred_7 obj_13 obj_17)
       (pred_7 obj_13 obj_12)
       (pred_7 obj_13 obj_10)
       (pred_7 obj_12 obj_02)
       (pred_7 obj_12 obj_24)
       (pred_7 obj_12 obj_13)
       (pred_7 obj_24 obj_18)
       (pred_7 obj_24 obj_07)
       (pred_7 obj_24 obj_12)
       (pred_7 obj_07 obj_14)
       (pred_7 obj_07 obj_24)
       (pred_7 obj_19 obj_29)
       (pred_7 obj_19 obj_17)
       (pred_7 obj_19 obj_10)
       (pred_7 obj_17 obj_11)
       (pred_7 obj_17 obj_02)
       (pred_7 obj_17 obj_13)
       (pred_7 obj_17 obj_19)
       (pred_7 obj_02 obj_04)
       (pred_7 obj_02 obj_18)
       (pred_7 obj_02 obj_12)
       (pred_7 obj_02 obj_17)
       (pred_7 obj_18 obj_03)
       (pred_7 obj_18 obj_14)
       (pred_7 obj_18 obj_24)
       (pred_7 obj_18 obj_02)
       (pred_7 obj_14 obj_06)
       (pred_7 obj_14 obj_07)
       (pred_7 obj_14 obj_18)
       (pred_7 obj_29 obj_21)
       (pred_7 obj_29 obj_11)
       (pred_7 obj_29 obj_19)
       (pred_7 obj_11 obj_20)
       (pred_7 obj_11 obj_04)
       (pred_7 obj_11 obj_17)
       (pred_7 obj_11 obj_29)
       (pred_7 obj_04 obj_30)
       (pred_7 obj_04 obj_03)
       (pred_7 obj_04 obj_02)
       (pred_7 obj_04 obj_11)
       (pred_7 obj_03 obj_26)
       (pred_7 obj_03 obj_06)
       (pred_7 obj_03 obj_18)
       (pred_7 obj_03 obj_04)
       (pred_7 obj_06 obj_01)
       (pred_7 obj_06 obj_14)
       (pred_7 obj_06 obj_03)
       (pred_7 obj_21 obj_05)
       (pred_7 obj_21 obj_20)
       (pred_7 obj_21 obj_29)
       (pred_7 obj_20 obj_15)
       (pred_7 obj_20 obj_30)
       (pred_7 obj_20 obj_11)
       (pred_7 obj_20 obj_21)
       (pred_7 obj_30 obj_08)
       (pred_7 obj_30 obj_26)
       (pred_7 obj_30 obj_04)
       (pred_7 obj_30 obj_20)
       (pred_7 obj_26 obj_09)
       (pred_7 obj_26 obj_01)
       (pred_7 obj_26 obj_03)
       (pred_7 obj_26 obj_30)
       (pred_7 obj_01 obj_27)
       (pred_7 obj_01 obj_06)
       (pred_7 obj_01 obj_26)
       (pred_7 obj_05 obj_15)
       (pred_7 obj_05 obj_21)
       (pred_7 obj_15 obj_08)
       (pred_7 obj_15 obj_20)
       (pred_7 obj_15 obj_05)
       (pred_7 obj_08 obj_09)
       (pred_7 obj_08 obj_30)
       (pred_7 obj_08 obj_15)
       (pred_7 obj_09 obj_27)
       (pred_7 obj_09 obj_26)
       (pred_7 obj_09 obj_08)
       (pred_7 obj_27 obj_01)
       (pred_7 obj_27 obj_09)
       (pred_1 obj_27)
       (pred_1 obj_03)
       (pred_1 obj_13)
       (pred_6  obj_27 obj_23)
       (pred_6  obj_03 obj_25)
       (pred_6  obj_13 obj_25)
       (pred_8 obj_10)
       (pred_8 obj_12)
       (pred_8 obj_24)
       (pred_8 obj_07)
       (pred_8 obj_19)
       (pred_8 obj_17)
       (pred_8 obj_02)
       (pred_8 obj_18)
       (pred_8 obj_14)
       (pred_8 obj_29)
       (pred_8 obj_11)
       (pred_8 obj_04)
       (pred_8 obj_06)
       (pred_8 obj_21)
       (pred_8 obj_20)
       (pred_8 obj_30)
       (pred_8 obj_26)
       (pred_8 obj_01)
       (pred_8 obj_05)
       (pred_8 obj_15)
       (pred_8 obj_08)
       (pred_8 obj_09)

       (pred_5  obj_22 obj_23)
       (pred_5  obj_16 obj_25)
       (pred_5  obj_28 obj_25)
       (pred_10 obj_22 obj_14)
       (pred_10 obj_16 obj_19)
       (pred_10 obj_28 obj_11)
       (pred_2 obj_06)
    )

    (:goal (and
       (pred_10 obj_22 obj_08)
       (pred_10 obj_16 obj_14)
    ))
(:constraints
  (always (not (pred_2 obj_02)))
)
)

; plan
1. (op_2 obj_06 obj_01)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_01)
   goals met: 0 of 2
2. (op_2 obj_01 obj_26)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_26)
   goals met: 0 of 2
3. (op_2 obj_26 obj_30)
   deleted: (pred_2 obj_26)
   added: (pred_2 obj_30)
   goals met: 0 of 2
4. (op_2 obj_30 obj_04)
   deleted: (pred_2 obj_30)
   added: (pred_2 obj_04)
   goals met: 0 of 2
5. (op_2 obj_04 obj_11)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_11)
   goals met: 0 of 2
6. (op_2 obj_11 obj_17)
   deleted: (pred_2 obj_11)
   added: (pred_2 obj_17)
   goals met: 0 of 2
7. (op_2 obj_17 obj_19)
   deleted: (pred_2 obj_17)
   added: (pred_2 obj_19)
   goals met: 0 of 2
8. (op_3 obj_19 obj_16)
   deleted: (pred_10 obj_16 obj_19) (pred_9)
   added: (pred_3 obj_16)
   goals met: 0 of 2
9. (op_2 obj_19 obj_17)
   deleted: (pred_2 obj_19)
   added: (pred_2 obj_17)
   goals met: 0 of 2
10. (op_2 obj_17 obj_11)
   deleted: (pred_2 obj_17)
   added: (pred_2 obj_11)
   goals met: 0 of 2
11. (op_2 obj_11 obj_04)
   deleted: (pred_2 obj_11)
   added: (pred_2 obj_04)
   goals met: 0 of 2
12. (op_4 obj_04 obj_03 obj_16 obj_25)
   deleted: (pred_1 obj_03)
   added: (pred_8 obj_03)
   goals met: 0 of 2
13. (op_2 obj_04 obj_03)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_03)
   goals met: 0 of 2
14. (op_2 obj_03 obj_18)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_18)
   goals met: 0 of 2
15. (op_2 obj_18 obj_14)
   deleted: (pred_2 obj_18)
   added: (pred_2 obj_14)
   goals met: 0 of 2
16. (op_1 obj_14 obj_22 obj_16)
   deleted: (pred_3 obj_16) (pred_10 obj_22 obj_14)
   added: (pred_3 obj_22) (pred_10 obj_16 obj_14)
   goals met: 1 of 2
17. (op_2 obj_14 obj_18)
   deleted: (pred_2 obj_14)
   added: (pred_2 obj_18)
   goals met: 1 of 2
18. (op_2 obj_18 obj_03)
   deleted: (pred_2 obj_18)
   added: (pred_2 obj_03)
   goals met: 1 of 2
19. (op_2 obj_03 obj_04)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_04)
   goals met: 1 of 2
20. (op_2 obj_04 obj_30)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_30)
   goals met: 1 of 2
21. (op_2 obj_30 obj_08)
   deleted: (pred_2 obj_30)
   added: (pred_2 obj_08)
   goals met: 1 of 2
22. (op_5 obj_08 obj_22)
   deleted: (pred_3 obj_22)
   added: (pred_9) (pred_10 obj_22 obj_08)
   goals met: 2 of 2
